Figure/Figure 5/simulations/parametrization/Ap15dp2T7/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    freeStream
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1;
        startFace       199;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       200;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       201;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       401;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       601;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       801;
    }
)

// ************************************************************************* //
